In [3]:
import numpy as np
import pandas as pd
from sklearn.datasets import fetch_california_housing

In [10]:
pre_data = fetch_california_housing()
pre_data.feature_names

['MedInc',
 'HouseAge',
 'AveRooms',
 'AveBedrms',
 'Population',
 'AveOccup',
 'Latitude',
 'Longitude']

In [4]:
data = fetch_california_housing()
df = pd.DataFrame(data.data, columns=data.feature_names)
df['target'] = data.target

In [13]:
df.shape

(20640, 9)

In [12]:
tt = pd.read_csv("titanic.csv")
tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
pd.isnull(tt).value_counts()

PassengerId  Survived  Pclass  Name   Sex    Age    SibSp  Parch  Ticket  Fare   Cabin  Embarked
False        False     False   False  False  False  False  False  False   False  True   False       529
                                                                                 False  False       183
                                             True   False  False  False   False  True   False       158
                                                                                 False  False        19
                                             False  False  False  False   False  False  True          2
Name: count, dtype: int64

In [17]:
from preproccess import count_missing

In [20]:
missing_df , total = count_missing(tt)

In [21]:
missing_df

             Total_missing
PassengerId              0
Survived                 0
Pclass                   0
Name                     0
Sex                      0
Age                    354
SibSp                    0
Parch                    0
Ticket                   0
Fare                     0
Cabin                 1374
Embarked                 4

In [22]:
total

np.int64(1732)